yeyidogan/P1_STM32F030/Firmware/modbus.c
/******************************************************************************
*	Written by Yilmaz Eyidogan
*	Modbus functions
*	Created date: 2015.01.05
*******************************************************************************/

#include <stdint.h>
#include "stm32f0xx.h"
#include "stm32f0xx_usart.h"
#include "stm32f0xx_misc.h"
#include "uart.h"
#include "pub_var.h"
#include "modbus.h"
#include "util.h"

/* Private typedef */
/* Private define */

/* Private macro */
/* Private variables */
MODBUS_REQUEST_FRAME mbRequestFrame;
uint8_t *ptrData, *ptrMax, *ptrMin;
MODBUS_TX_RX_DATA mbTxRxData;

const uint16_t wCrcTable[] = {
	0x0000, 0xC0C1, 0xC181, 0x0140, 0xC301, 0x03C0, 0x0280, 0xC241,
	0xC601, 0x06C0, 0x0780, 0xC741, 0x0500, 0xC5C1, 0xC481, 0x0440,
	0xCC01, 0x0CC0, 0x0D80, 0xCD41, 0x0F00, 0xCFC1, 0xCE81, 0x0E40,
	0x0A00, 0xCAC1, 0xCB81, 0x0B40, 0xC901, 0x09C0, 0x0880, 0xC841,
	0xD801, 0x18C0, 0x1980, 0xD941, 0x1B00, 0xDBC1, 0xDA81, 0x1A40,
	0x1E00, 0xDEC1, 0xDF81, 0x1F40, 0xDD01, 0x1DC0, 0x1C80, 0xDC41,
	0x1400, 0xD4C1, 0xD581, 0x1540, 0xD701, 0x17C0, 0x1680, 0xD641,
	0xD201, 0x12C0, 0x1380, 0xD341, 0x1100, 0xD1C1, 0xD081, 0x1040,
	0xF001, 0x30C0, 0x3180, 0xF141, 0x3300, 0xF3C1, 0xF281, 0x3240,
	0x3600, 0xF6C1, 0xF781, 0x3740, 0xF501, 0x35C0, 0x3480, 0xF441,
	0x3C00, 0xFCC1, 0xFD81, 0x3D40, 0xFF01, 0x3FC0, 0x3E80, 0xFE41,
	0xFA01, 0x3AC0, 0x3B80, 0xFB41, 0x3900, 0xF9C1, 0xF881, 0x3840,
	0x2800, 0xE8C1, 0xE981, 0x2940, 0xEB01, 0x2BC0, 0x2A80, 0xEA41,
	0xEE01, 0x2EC0, 0x2F80, 0xEF41, 0x2D00, 0xEDC1, 0xEC81, 0x2C40,
	0xE401, 0x24C0, 0x2580, 0xE541, 0x2700, 0xE7C1, 0xE681, 0x2640,
	0x2200, 0xE2C1, 0xE381, 0x2340, 0xE101, 0x21C0, 0x2080, 0xE041,
	0xA001, 0x60C0, 0x6180, 0xA141, 0x6300, 0xA3C1, 0xA281, 0x6240,
	0x6600, 0xA6C1, 0xA781, 0x6740, 0xA501, 0x65C0, 0x6480, 0xA441,
	0x6C00, 0xACC1, 0xAD81, 0x6D40, 0xAF01, 0x6FC0, 0x6E80, 0xAE41,
	0xAA01, 0x6AC0, 0x6B80, 0xAB41, 0x6900, 0xA9C1, 0xA881, 0x6840,
	0x7800, 0xB8C1, 0xB981, 0x7940, 0xBB01, 0x7BC0, 0x7A80, 0xBA41,
	0xBE01, 0x7EC0, 0x7F80, 0xBF41, 0x7D00, 0xBDC1, 0xBC81, 0x7C40,
	0xB401, 0x74C0, 0x7580, 0xB541, 0x7700, 0xB7C1, 0xB681, 0x7640,
	0x7200, 0xB2C1, 0xB381, 0x7340, 0xB101, 0x71C0, 0x7080, 0xB041,
	0x5000, 0x90C1, 0x9181, 0x5140, 0x9301, 0x53C0, 0x5280, 0x9241,
	0x9601, 0x56C0, 0x5780, 0x9741, 0x5500, 0x95C1, 0x9481, 0x5440,
	0x9C01, 0x5CC0, 0x5D80, 0x9D41, 0x5F00, 0x9FC1, 0x9E81, 0x5E40,
	0x5A00, 0x9AC1, 0x9B81, 0x5B40, 0x9901, 0x59C0, 0x5880, 0x9841,
	0x8801, 0x48C0, 0x4980, 0x8941, 0x4B00, 0x8BC1, 0x8A81, 0x4A40,
	0x4E00, 0x8EC1, 0x8F81, 0x4F40, 0x8D01, 0x4DC0, 0x4C80, 0x8C41,
	0x4400, 0x84C1, 0x8581, 0x4540, 0x8701, 0x47C0, 0x4680, 0x8641,
	0x8201, 0x42C0, 0x4380, 0x8341, 0x4100, 0x81C1, 0x8081, 0x4040};

/**
 *******************************************************************************
 * @brief       increase data pointer
 *******************************************************************************
 */
void incPtrData(void) {
	++ptrData;
	if (ptrData > ptrMax) {
		ptrData = ptrMin;
	}
}

/**
*******************************************************************************
* @brief       calculate crc
* @param[in]   ptrCell: pointer of data
* @param[in]   length: length of data
* @param[out]  Crc
*******************************************************************************
*/
void crc16(uint8_t *ptrCell, uint16_t length) {
	uint8_t nTemp;
	UINT16_TYPE wCrcWord = {0xFFFF};

	mbTxRxData.uartTxPtr->length = length + 2; //size of transmit data
	while (length--) {
		nTemp = *ptrCell++ ^ wCrcWord.word;
		wCrcWord.word >>= 8;
		wCrcWord.word ^= wCrcTable[nTemp];
	}
	*ptrCell++ = wCrcWord.bytes.high_byte;
	*ptrCell = wCrcWord.bytes.low_byte;
}

/**
*******************************************************************************
* @brief       check crc
* @param[in]   ptrCell: pointer of data
* @param[in]   length: length of data
* @param[out]  TRUE or FALSE
*******************************************************************************
*/
uint8_t checkCrc16(const uint8_t *ptrCell, uint16_t length) {
	uint8_t nTemp;
	UINT16_TYPE wCrcWord = {0xFFFF};

	while (length--) {
		nTemp = *ptrCell ^ wCrcWord.word;
		++ptrCell;
		if (ptrCell > ptrMax)
			ptrCell = ptrMin;
		wCrcWord.word >>= 8;
		wCrcWord.word ^= wCrcTable[nTemp];
	}
	if (wCrcWord.bytes.high_byte == *ptrCell) {
		++ptrCell;
		if (ptrCell > ptrMax)
			ptrCell = ptrMin;
		if (wCrcWord.bytes.low_byte == *ptrCell)
			return TRUE;
	}
	return FALSE;
}

/**
*******************************************************************************
* @brief       prepare exception error message
* @param[in]   exceptionCode
* @param[out]  none
*******************************************************************************
*/
#define EXCEPTION_RESP_LENGTH 0x02 //without CRC
void mbReturnException(uint8_t exceptionCode) {
	uint8_t *ptrTarget = mbTxRxData.uartTxPtr->buffer;

	*ptrTarget++ = mbRequestFrame.mbFunction + 0x80;
	*ptrTarget++ = exceptionCode;

	crc16(mbTxRxData.uartTxPtr->buffer, EXCEPTION_RESP_LENGTH);
}

/**
*******************************************************************************
* @brief       mbCheckLimits for Exception 3
* @param[in]   maxLimit = 0x7D0 or maxLimit = 0x7D
* @param[out]  TRUE or FALSE
* @details     none.
*******************************************************************************
*/
uint8_t mbCheckLimits(uint16_t maxLimit) {
	if (mbRequestFrame.mbNumOfRegOrCoil.word > 0x00 && mbRequestFrame.mbNumOfRegOrCoil.word < maxLimit)
		return TRUE;
	else
		return FALSE;
}

/**
*******************************************************************************
* @brief       modbusRTU main code
* @param[in]   none
* @param[out]  none
* @details     none.
*******************************************************************************
*/
#define MAX_QTY_OUTPUT 0x7D0
#define MAX_QTY_REGISTER 0x7D
void modbusRTU(void) {
	if (mbTxRxData.uartRxPtr->length < MB_MIN_FRAME_SIZE) //return if there is no enough data
		return;

	ptrData = &(mbTxRxData.uartRxPtr->buffer[mbTxRxData.uartRxPtr->firstDataId]);
	ptrMax = &(mbTxRxData.uartRxPtr->buffer[UART_RX_BUFFER_SIZE - 1]);
	ptrMin = &(mbTxRxData.uartRxPtr->buffer[0]);

	if (*ptrData == mbTxRxData.mbAddress) {
		incPtrData();
		mbRequestFrame.mbFunction = *ptrData;
		incPtrData();
		mbRequestFrame.mbRegAddress.bytes.high_byte = *ptrData;
		incPtrData();
		mbRequestFrame.mbRegAddress.bytes.low_byte = *ptrData;
		incPtrData();
		mbRequestFrame.mbNumOfRegOrCoil.bytes.high_byte = *ptrData;
		incPtrData();
		mbRequestFrame.mbNumOfRegOrCoil.bytes.low_byte = *ptrData;
		incPtrData();

		switch (mbRequestFrame.mbFunction) {
			case MBFN_READ_COILS:
				if (checkCrc16(&(mbTxRxData.uartRxPtr->buffer[mbTxRxData.uartRxPtr->firstDataId]), MB_MIN_FRAME_SIZE - 2)) {
					if (mbCheckLimits(MAX_QTY_OUTPUT)) {
						if (mbRequestFrame.mbRegAddress.word + mbRequestFrame.mbNumOfRegOrCoil.word < MB_COIL_SIZE) {
							//mbReadCoilRegister();
						}
						else {
							mbReturnException(OUT_OF_DATA_REGION);
						}
					}
					else {
						mbReturnException(OUT_OF_MB_LIMIT);
					}
				}
				break;
			case MBFN_READ_DISCRETE_INPUTS:
				break;
			case MBFN_READ_HOLDING_REGISTERS:
				break;
			case MBFN_READ_INPUT_REGISTERS:
				break;
			case MBFN_WRITE_SINGLE_COIL:
				break;
			case MBFN_WRITE_SINGLE_REGISTER:
				break;
			case MBFN_WRITE_MULTIPLE_COILS:
				break;
			case MBFN_WRITE_MULTIPLE_REGISTERS:
				break;
			default:
				break;
		}
	}
}

